Tekla Open API Reference for Tekla Structures 2025
ProfileSelectionForm Properties
The ProfileSelectionForm type exposes the following members.
Properties
Name | Description
SelectedProfile
 The selected profile.
Top
See Also
Reference
ProfileSelectionForm Class
Tekla.Structures.Dialog.UIControls Namespace